{
  "color": "#e74c3c",
  "title": "Personal Projects",
  "subtitle": "Check out some of the cool projects I've worked on over the years!",
  "main": "  <span style='text-align:center; font-weight:bold; font-size:1.5em;'>Publications</span>  <br/>  <a class='links' href='https://github.com/schung039/contextual-repr-manifolds'>Emergence of Separable Manifolds in Deep Language Representations</a> - as one of the authors of this paper, I helped developed the code used to measure the emergence of linguistic information manifolds. The paper that resulted from these analyses was accepted to ICML 2020 and can be found <a class='links' href='https://arxiv.org/pdf/2006.01095.pdf'>here</a>.  <br/>  <br/>  <span style='text-align:center; font-weight:bold; font-size:1.5em;'>Websites</span>  <br/>  <a class='links' href='https://pique0822.github.io/VideoLectures/'>vid&middot;in</a> - this project was developed with the purpose of providing teachers an easy way to upload lectures online, ask questions, and receive student answers through the same website. This project included a feature that snapped a picture of the student as a question was answered to ensure that the appropriate person was answering the questions.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/chatbots/'>Personal Chatbot</a> - this website provides a way for anyone to make a chatbot and share it using a code. The chatbot can be personalized with your own questions, color, and/or name. Users of the chatbot can ask questions and a simple question-answering system will reply with the most likely answer.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/SimplyDiabetes/'>Diabetes Tracking App</a> - this app was designed to facilitate a Type 1 diabetic's carbohydrate intake calculations, meal tracking, and blood sugar tracking. Originally was designed as part of a class project but was extended by me.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/ContinuedFractionVisualizer/'>Visualizing Continued Fractions</a> - in this project I try to \"see\" irrational numbers by drawing them on a 2D plane using simple rules.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/VisualizingFractions/'>Visualizing Fractions</a> - a simple visualization of all kinds of fractions shown as pieces of a pie.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/MemoryWords/'>Memory</a> - a simple implementation of memory.  <br/>  <br/>  <a class='links' href='https://pique0822.github.io/CandyCrush_3.0/'>Candy Crush</a> - an implementation of candy crush.  <br/>  <br/>  "
}
